Revit 2024 API
MeshFromGeometryOperationResult.GetIssues Method
 Returns the array of issues encountered while building a mesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public IList<MeshFromGeometryOperationIssue> GetIssues()
Visual Basic
Public Function GetIssues As IList(Of MeshFromGeometryOperationIssue)
Visual C++
public:
IList<MeshFromGeometryOperationIssue>^ GetIssues()
Return Value
 Array of issues encountered while building a mesh.
See Also
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace